Documents/ПереработкаОвощей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереработкаОвощей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type><v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладИсточник</Name>
					<Type><v8:Type>cfg:CatalogRef.МестаХранения</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПриемник</Name>
					<Type><v8:Type>cfg:CatalogRef.МестаХранения</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers><v8:Length>0</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураСырье</Name>
							<Type><v8:Type>cfg:CatalogRef.Номенклатура</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСырье</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПродукция</Name>
							<Type><v8:Type>cfg:CatalogRef.Номенклатура</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПродукция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПотерь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОпераций</Name>
							<Type><v8:Type>cfg:EnumRef.ВидыОперации</v8:Type></Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПереработкаОвощей/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВыборкаМестХранения = Справочники.МестаХранения.Выбрать();
		Если ВыборкаМестХранения.Следующий() Тогда
			Объект.СкладИсточник = ВыборкаМестХранения.Ссылка;
			Объект.СкладПриемник = ВыборкаМестХранения.Ссылка;
		КонецЕсли;
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоСырьеПриИзменении(Элемент)
	ПересчитатьСтрокуТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПотерьПриИзменении(Элемент)
	ПересчитатьСтрокуТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуТоваров()
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.КоличествоСырье) Тогда
		СтрокаТабличнойЧасти.КоличествоСырье = 0;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.КоличествоПотерь) Тогда
		СтрокаТабличнойЧасти.КоличествоПотерь = 0;
	КонецЕсли;
	
	КоличествоПродукции = СтрокаТабличнойЧасти.КоличествоСырье - СтрокаТабличнойЧасти.КоличествоПотерь;
	Если КоличествоПродукции < 0 Тогда
		КоличествоПродукции = 0;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.КоличествоПродукция = КоличествоПродукции;
КонецПроцедуры
